'use strict';

const nickRegex = /\] ?([a-zA-Z]+[ |_][a-zA-Z]+)/i;

const colors = {
  red: '#ff0000',
  blue: '#0000ff',
  green: '#00ff00',
  blurple: '#5865f2',
  orange: '#ffa333',
};

const organzationCategories = {
  '👮 Министерство юстиции': [1, 4, 23, 2, 3],
  '🧑‍⚕️ Министерство здравоохранения': [5, 8, 22],
  '💼 Правительство': [6, 9, 21, 29],
  '📷 Средства массовой информации': [10, 26, 24],
  '🪖 Министерство обороны': [20, 27, 7],
};

const OrganizationNames = {
  1: 'Полиция ЛС',
  4: 'Полиция СФ',
  23: 'Полиция ЛВ',
  2: 'Полиция РК',
  3: 'ФБР',

  5: 'Больница ЛС',
  8: 'Больница СФ',
  22: 'Больница ЛВ',

  6: 'Правительство',
  9: 'Автошкола',
  21: 'Центральный банк',
  29: 'Страховочная компания',

  10: 'СМИ ЛС',
  26: 'СМИ СФ',
  24: 'СМИ ЛВ',

  20: 'Армия ЛС',
  27: 'Армия СФ',
  7: 'ТСР',
};

module.exports = { colors, OrganizationNames, organzationCategories, nickRegex };
